InformationRegisters/ЭТ_КомиссияТО_ПоУмолчанию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЭТ_КомиссияТО_ПоУмолчанию</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МетодРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭТ_КомиссияТО_МетодРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Фиксированная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ЭТ_КомиссияТО/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)       
	ЭтотОбъект.ЭТ_КомиссияТО_Организация = Параметры.Организация;
	ЭтотОбъект.ЭТ_КомиссияТО_Контрагент = Параметры.Контрагент;
	Если ЭтотОбъект.ЭТ_КомиссияТО_Организация.Пустая() Тогда
		ЭтотОбъект.ЭТ_КомиссияТО_Организация =	Пользователи.ТекущийПользователь().Подразделение.Владелец;
	КонецЕсли;	
	Комиссия = РегистрыСведений.ЭТ_КомиссияТО_ПоУмолчанию.ПолучитьКомиссиюТОПоУмолчанию(ЭтотОбъект.ЭТ_КомиссияТО_Организация,ЭтотОбъект.ЭТ_КомиссияТО_Контрагент);
	ЭтотОбъект.ЭТ_КомиссияТО_МетодРасчета = Комиссия.МетодРасчета;
	ЭтотОбъект.ЭТ_КомиссияТО_Процент = Комиссия.Процент;
	ЭтотОбъект.ЭТ_КомиссияТО_Фиксированная = Комиссия.Фиксированная;     
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	НоваяЗапись = РегистрыСведений.ЭТ_КомиссияТО_ПоУмолчанию.СоздатьМенеджерЗаписи();
	НоваяЗапись.Организация = ЭтотОбъект.ЭТ_КомиссияТО_Организация;
	НоваяЗапись.Контрагент = ЭтотОбъект.ЭТ_КомиссияТО_Контрагент;
	НоваяЗапись.МетодРасчета = ЭтотОбъект.ЭТ_КомиссияТО_МетодРасчета;    
	НоваяЗапись.Процент = ЭтотОбъект.ЭТ_КомиссияТО_Процент;
	НоваяЗапись.Фиксированная = ЭтотОбъект.ЭТ_КомиссияТО_Фиксированная;  
	НоваяЗапись.Записать(Истина);
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры
